000001 01  XQ-NAICS1-REC.
000002     05  XQ-NAICS1-CD           PIC 9(06).
000003         88  XQ-BUILDING        VALUES 236115 236116 236117
000004                                       236118 236210 236220
000005                                       237110 237120 237130
000006                                       237210 237310 237990.
000007     05  XQ-NAICS1-DESC         PIC X(40).
