//R10SORT  PROC IN=PROD.CMN.SORTIN,OUT=PROD.CMN.SORTOUT,CARDS=DEFCARD
//SRT010   EXEC PGM=SORT
//SORTIN   DD   DSN=&IN,DISP=SHR
//SORTOUT  DD   DSN=&OUT,DISP=(NEW,CATLG,DELETE),UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSIN    DD   DSN=PROD.CMN.PARMLIB(&CARDS),DISP=SHR
//SYSOUT   DD   SYSOUT=*
