       01  XQ-NAICS-REC.
           05  XQ-NAICS-CD            PIC 9(06).
               88  XQ-CONSTRUCTION    VALUES 236115 236116 236117
                                             236118 236210 236220
                                             237110 237120 237130
                                             237210 237310 237990.
           05  XQ-NAICS-DESC          PIC X(40).
