       IDENTIFICATION DIVISION.
       PROGRAM-ID. R14PGM.
       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
           SELECT IN-FILE ASSIGN TO INFILE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       FILE SECTION.
       FD  IN-FILE.
       01  IN-RECORD        PIC X(80).
       WORKING-STORAGE SECTION.
       01  WS-DATE-INT      PIC S9(09) COMP.
       01  WS-DATE          PIC 9(08).
       PROCEDURE DIVISION.
       0000-MAIN.
           OPEN INPUT IN-FILE
           COMPUTE WS-DATE-INT = FUNCTION INTEGER-OF-DATE(WS-DATE)
           CLOSE IN-FILE
           GOBACK.
