//R12JOB   JOB  (ACCT),'SORT',CLASS=A,MSGCLASS=X
//STEP010  EXEC PGM=SORT
//SORTIN   DD   DSN=PROD.R12.IN,DISP=SHR
//SORTOUT  DD   DSN=PROD.R12.OUT,DISP=(NEW,CATLG,DELETE),UNIT=SYSDA,SPACE=(CYL,(1,1))
//SYSIN    DD   *
  SORT FIELDS=(1,12,CH,A)
  INCLUDE COND=(13,2,CH,EQ,C'AC')
/*
//
