 XQPLI: PROC OPTIONS(MAIN);
   DCL 1 POLREC,
         2 POLID CHAR(10),
         2 AMT FIXED DEC(9,2);
   ON ENDFILE(POLIN) GO TO EOJ;
   READ FILE(POLIN) INTO(POLREC);
   IF AMT > 0 THEN
      GO TO EOJ;
 EOJ:
   CLOSE FILE(POLIN);
 END XQPLI;
