       IDENTIFICATION DIVISION.
       PROGRAM-ID. R06PGM.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  R06-RECORD.
           COPY R06OUTER.
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE SPACES TO R06-AFTER
           GOBACK.
