000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. CONDLOGX.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  WS-REL-CD                PIC 9.
000600     88  WS-REL-SON           VALUE 3.
000700     88  WS-REL-DAUGHTER      VALUE 4.
000800 01  WS-GENDER-CD             PIC X.
000900     88  WS-GENDER-UNK        VALUE 'U'.
001000 01  WS-STATUS                PIC X(02).
001100 01  WS-MSG-TABLE.
001200     05  FILLER               PIC X(15)
001300                              VALUE 'RELATIONSHIP/GE'.
001400     05  FILLER               PIC X(15)
001500                              VALUE 'NDER MISMATCH'.
001600 01  WS-LONG-VALUE
001700                              PIC X(50)
001800     VALUE 'THIS VALUE IS SPLIT WITH A CONTINUATION HY
001900-    'PHEN'.
002000 01  GENDERI                  PIC X.
002100 PROCEDURE DIVISION.
002200 0000-MAIN.
002300     IF (WS-REL-CD = 3 OR 4)
002400        AND (WS-GENDER-CD = 'M'
002500             OR WS-GENDER-CD = 'F')
002600        AND NOT WS-GENDER-UNK
002700         MOVE 'OK' TO WS-STATUS
002800     END-IF.
002900     IF WS-REL-CD = 1 AND WS-GENDER-CD = 'M' OR 'F'
003000         CONTINUE
003100     END-IF.
003200     EVALUATE WS-REL-CD ALSO WS-GENDER-CD
003300         WHEN 3 ALSO 'M'
003400             CONTINUE
003500         WHEN 4 ALSO 'F'
003600             CONTINUE
003700         WHEN 2 ALSO ANY
003800             CONTINUE
003900     END-EVALUATE.
004000     IF GENDERI = 'M' OR 'F' OR 'N'
004100         MOVE GENDERI TO WS-GENDER-CD
004200     END-IF.
004300     GOBACK.
