000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. ERRPGM.
000300 ENVIRONMENT DIVISION.
000400 INPUT-OUTPUT SECTION.
000500 FILE-CONTROL.
000600     SELECT CLAIM-FILE ASSIGN TO UT-S-CLMFILE.
000700 DATA DIVISION.
000800 FILE SECTION.
000900 FD  CLAIM-FILE.
001000 01  CLAIM-REC              PIC X(100).
001100 WORKING-STORAGE SECTION.
001200     EXEC SQL INCLUDE POLDCL END-EXEC.
001300 01  WS-CALL-FLAG           PIC X VALUE 'N'.
001400 01  WS-ERR-CD              PIC X(04) VALUE 'E999'.
001500     88  WS-ERR-NONE        VALUE 'E000'.
001600     88  WS-ERR-FATAL       VALUE 'E900' THRU 'E999'.
001700 01  WS-AMT                 PIC S9(7)V99 COMP-3.
001800 01  WS-KEY                 PIC X(10).
001900     EXEC SQL DECLARE POLCUR CURSOR FOR
002000         SELECT POL_NO FROM POLICY_TBL
002100          WHERE STATUS_CD = :WS-ERR-CD
002200            FOR UPDATE OF PREM_AMT
002300     END-EXEC.
002400 LINKAGE SECTION.
002500 01  LK-RC                  PIC X(04).
002600 PROCEDURE DIVISION USING LK-RC.
002700 0000-MAIN.
002800     MOVE WS-CALL-FLAG TO WS-KEY.
002900     IF WS-AMT > 0
003000         MOVE 'E001' TO WS-ERR-CD
003100     ELSE
003200         MOVE 'E002' TO WS-ERR-CD
003300     END-IF.
003400     IF WS-ERR-CD = 'E001' OR 'E002'
003500         DISPLAY 'ERROR: ' WS-ERR-CD
003600     END-IF.
003700     EVALUATE WS-ERR-CD
003800         WHEN 'E000'
003900             CONTINUE
004000         WHEN 'E900' THRU 'E999'
004100             PERFORM 9000-ABEND
004200     END-EVALUATE.
004300     EXEC SQL
004400         SELECT PREM_AMT INTO :WS-AMT
004500           FROM POLICY_TBL
004600          WHERE POL_NO = :WS-KEY
004700     END-EXEC.
004800     EXEC SQL
004900         INSERT INTO AUDIT_TBL (COL1) VALUES (:WS-ERR-CD)
005000     END-EXEC.
005100     CALL 'ERRLOG' USING WS-ERR-CD WS-AMT.
005200     MOVE WS-ERR-CD TO LK-RC.
005300     GOBACK.
005400 9000-ABEND.
005500     DISPLAY 'FATAL ' WS-ERR-CD.
