000100 05  IR-KEY-AREA.
000200     10  IR-KEY              PIC X(12).
000300     10  IR-STAT             PIC X(02).
000400         88  IR-LAPSED       VALUE 'LP'.
000500 05  IR-REST                 PIC X(26).
