//FLOWJOB2 JOB (ACCT),'STATUS REFORMAT',CLASS=A,MSGCLASS=X
//STEP1    EXEC PGM=SORT
//SORTIN   DD DSN=TEST.STAT.OUT(0),DISP=SHR
//SORTOUT  DD DSN=TEST.STAT.REFMT,DISP=(NEW,CATLG,DELETE)
//SYSIN    DD *
  SORT FIELDS=(1,12,CH,A)
  OUTREC FIELDS=(13,2,1,12)
/*
//STEP2    EXEC PGM=FLOWRDR
//STATIN   DD DSN=TEST.STAT.REFMT,DISP=SHR
//
