000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. MEMBRVAL.
000300 DATA DIVISION.
000400 WORKING-STORAGE SECTION.
000500 01  WS-MEMBER-REC.
000600     05  WS-REL-CD            PIC 9(01).
000700         88  WS-REL-MAIN      VALUE 1.
000800         88  WS-REL-SPOUSE    VALUE 2.
000900         88  WS-REL-SON       VALUE 3.
001000         88  WS-REL-DAUGHTER  VALUE 4.
001100     05  WS-GENDER-CD         PIC X(01).
001200         88  WS-GENDER-MALE   VALUE 'M'.
001300         88  WS-GENDER-FEMALE VALUE 'F'.
001400         88  WS-GENDER-UNK    VALUE 'U'.
001500 01  WS-ERR-CD                PIC X(04).
001600 01  WS-ERR-MSG               PIC X(40).
001700 01  WS-CNT                   PIC S9(4) COMP.
001800 PROCEDURE DIVISION.
001900 0000-MAIN.
002000     EVALUATE WS-REL-CD
002100         WHEN 3
002200             IF NOT WS-GENDER-MALE
002300                 MOVE 'E101' TO WS-ERR-CD
002400                 MOVE 'GENDER MUST BE MALE FOR SON' TO WS-ERR-MSG
002500             END-IF
002600         WHEN 4
002700             IF WS-GENDER-CD NOT = 'F'
002800                 MOVE 'E102' TO WS-ERR-CD
002900                 MOVE 'GENDER MUST BE FEMALE FOR DAUGHTER'
003000                                          TO WS-ERR-MSG
003100             END-IF
003200         WHEN 5
003300             MOVE 2 TO WS-REL-CD
003400         WHEN OTHER
003500             CONTINUE
003600     END-EVALUATE.
003700     IF WS-REL-SPOUSE AND WS-GENDER-CD = 'U'
003800         MOVE 'E103' TO WS-ERR-CD
003900     END-IF.
004000     EXEC SQL
004100         SELECT COUNT(*) INTO :WS-CNT
004200           FROM MEMBER_TBL
004300          WHERE REL_CD = 3
004400            AND GENDER_CD IN ('M', 'F')
004500     END-EXEC.
004600     DISPLAY WS-ERR-CD ' ' WS-ERR-MSG.
004700     GOBACK.
