MEMFMT   FMT
         DEV   TYPE=3270-A2,FEAT=IGNORE,SYSMSG=SYSMSGL
         DIV   TYPE=INOUT
         DPAGE CURSOR=((3,10))
         DFLD  'GENDER:',POS=(3,1),LTH=7
GENDER   DFLD  POS=(3,10),LTH=1,ATTR=(NUM,MOD)
         DFLD  'RELATIONSHIP:',POS=(4,1),LTH=13
RELCD    DFLD  POS=(4,16),LTH=1
ERRMSG   DFLD  POS=(23,1),LTH=40
         FMTEND
MEMFIP   MSG   TYPE=INPUT,SOR=(MEMFMT,IGNORE),NXT=MEMFOP
         SEG
         MFLD  'MEMB ',LTH=5
         MFLD  GENDER,LTH=1
         MFLD  RELCD,LTH=1
         MSGEND
MEMFOP   MSG   SOR=(MEMFMT,IGNORE),NXT=MEMFIP
         SEG
         MFLD  (GENDER,'U'),LTH=1,ATTR=YES
         MFLD  RELCD,LTH=1
         MFLD  ERRMSG,LTH=40
         MSGEND
         END
