MEMSET   DFHMSD TYPE=&SYSPARM,MODE=INOUT,LANG=COBOL,STORAGE=AUTO,
               TIOAPFX=YES
MEMMAP   DFHMDI SIZE=(24,80),LINE=1,COLUMN=1
         DFHMDF POS=(3,1),LENGTH=7,ATTRB=(ASKIP,BRT),INITIAL='GENDER:'
GENDER   DFHMDF POS=(3,10),LENGTH=1,ATTRB=(UNPROT,FSET),INITIAL='U',
               PICIN='X',PICOUT='X'
         DFHMDF POS=(4,1),LENGTH=13,ATTRB=ASKIP,INITIAL='RELATIONSHIP:'
RELCD    DFHMDF POS=(4,16),LENGTH=1,ATTRB=(UNPROT,NUM),PICIN='9'
ERRMSG   DFHMDF POS=(23,1),LENGTH=40,ATTRB=(ASKIP,BRT)
         DFHMSD TYPE=FINAL
         END
