//NIGHTLY  PROC HLQ=TEST.CLM,RPTDT=00000000
//*
//* CLAIMS NIGHTLY - POST, REPORT, BACKUP
//*
//PS010    EXEC PGM=CLMPOST,PARM='&RPTDT'
//STEPLIB  DD DSN=&HLQ..OLDLOAD,DISP=SHR
//MASTER   DD DSN=&HLQ..MASTER,DISP=OLD
//TEMP1    DD DSN=&&TEMP,DISP=(NEW,PASS),UNIT=SYSDA,SPACE=(TRK,(5,5))
//SYSIN    DD DUMMY
//PS020    EXEC PGM=IKJEFT01
//SYSTSIN  DD *
  DSN SYSTEM(DB2P)
  RUN PROGRAM(CLMRPT) PLAN(CLMRPT)
  END
/*
//EXTRACT  DD DSN=&HLQ..EXTRACT(+1),DISP=(NEW,CATLG)
//PS030    EXEC PGM=IDCAMS
//MASTER   DD DSN=&HLQ..MASTER,DISP=SHR
//SYSIN    DD *
  DEFINE CLUSTER (NAME(PROD.CLM.NEW.KSDS) -
         KEYS(12 0) RECORDSIZE(422 422))
  REPRO INFILE(MASTER) OUTDATASET(PROD.CLM.BACKUP)
/*
//PS040    EXEC CLMSUB
