         PCB   TYPE=DB,DBDNAME=R01DBD,PROCOPT=G,KEYLEN=12
         SENSEG NAME=R01ROOT,PARENT=0
         PSBGEN LANG=COBOL,PSBNAME=R01IMS,CMPAT=YES
         END
