       IDENTIFICATION DIVISION.
       PROGRAM-ID. R05ONE.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
           EXEC SQL INCLUDE SQLCA END-EXEC.
           EXEC SQL INCLUDE R05TBL END-EXEC.
       PROCEDURE DIVISION.
       0000-MAIN.
           MOVE 'AC' TO STATUS-CD
           GOBACK.
