//KVSORT   PROC CARDS=KVDEFC
//SRT010   EXEC PGM=SORT
//SORTIN   DD   DSN=PROD.KV.SORTIN,DISP=SHR
//SORTOUT  DD   DSN=PROD.KV.SORTOUT,DISP=(NEW,CATLG,DELETE)
//SYSIN    DD   DSN=PROD.KV.CARDS.&CARDS,DISP=SHR
//SYSOUT   DD   SYSOUT=*
