       01  :PCB:-PCB.
           05  :PCB:-DBD-NAME         PIC X(08).
           05  :PCB:-SEG-LEVEL        PIC X(02).
           05  :PCB:-STATUS           PIC X(02).
               88  :PCB:-OK           VALUE '  '.
               88  :PCB:-END-OF-DB    VALUE 'GB'.
