//KVGDG    PROC
//PS1      EXEC PGM=KVEXTR
//OUT      DD   DSN=PROD.KV.EXTRACT(+1),DISP=(NEW,CATLG,DELETE)
//PS2      EXEC PGM=KVREAD
//KVIN     DD   DSN=PROD.KV.OTHER,DISP=SHR
